The terraform apply got further with the following configuration which added the ibm_pi_volume resource.  The issue is happening on multiple regions and zones.

```
variable "ibmcloud_api_key" {
    default = "<not shared>"
}
variable "region" {
    default = "lon"
}
variable "zone" {
    default = "eu-gb-3"
}

terraform {
  required_providers {
    ibm = {
      source = "IBM-Cloud/ibm"
      version = "> 1.26"
    }
  }
  required_version = ">= 0.13"
}

provider "ibm" {
    ibmcloud_api_key = var.ibmcloud_api_key
    region = var.region
    zone = var.zone
}

resource "ibm_pi_volume" "suse_volume"{
  pi_volume_size       = 20
  pi_volume_name       = "suse-test-volume"
  pi_volume_type       = "tier1"
  pi_volume_shareable  = false
  pi_cloud_instance_id = "94ded72b-b08d-4618-b60d-5c3da2dcd3f8"
}

resource "ibm_pi_instance" "suse_instance" {
    pi_memory             = "8"
    pi_processors         = "2"
    pi_instance_name      = "suse-test"
    pi_proc_type          = "shared"
    pi_image_id           = "8f9c2035-0aa5-41ef-adb4-1c51b4f104e3"
    pi_network_ids        = ["90efd71d-2e58-4a36-9d28-3cab63c573f6"]
    pi_key_pair_name      = "suse-ibm"
    pi_sys_type           = "s922"
    pi_cloud_instance_id  = "94ded72b-b08d-4618-b60d-5c3da2dcd3f8"
    pi_volume_ids         = [ibm_pi_volume.suse_volume.volume_id]
    pi_pin_policy         = "none"
    pi_replication_policy = "none"
    pi_replicants         = "1"
    pi_replication_scheme = "suffix"
    pi_health_status      = "WARNING"
}
```
but still failed.

```
> terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_pi_instance.suse_instance will be created
  + resource "ibm_pi_instance" "suse_instance" {
      + addresses                 = (known after apply)
      + health_status             = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + max_memory                = (known after apply)
      + max_processors            = (known after apply)
      + max_virtual_cores         = (known after apply)
      + migratable                = (known after apply)
      + min_memory                = (known after apply)
      + min_processors            = (known after apply)
      + min_virtual_cores         = (known after apply)
      + operating_system          = (known after apply)
      + os_type                   = (known after apply)
      + pi_cloud_instance_id      = "94ded72b-b08d-4618-b60d-5c3da2dcd3f8"
      + pi_health_status          = "WARNING"
      + pi_image_id               = "8f9c2035-0aa5-41ef-adb4-1c51b4f104e3"
      + pi_instance_name          = "suse-test"
      + pi_key_pair_name          = "suse-ibm"
      + pi_memory                 = 8
      + pi_network_ids            = [
          + "90efd71d-2e58-4a36-9d28-3cab63c573f6",
        ]
      + pi_pin_policy             = "none"
      + pi_proc_type              = "shared"
      + pi_processors             = 2
      + pi_progress               = (known after apply)
      + pi_replicants             = 1
      + pi_replication_policy     = "none"
      + pi_replication_scheme     = "suffix"
      + pi_sys_type               = "s922"
      + pi_virtual_cores_assigned = (known after apply)
      + pi_volume_ids             = (known after apply)
      + pin_policy                = (known after apply)
      + status                    = (known after apply)
    }

  # ibm_pi_volume.suse_volume will be created
  + resource "ibm_pi_volume" "suse_volume" {
      + delete_on_termination = (known after apply)
      + id                    = (known after apply)
      + pi_cloud_instance_id  = "94ded72b-b08d-4618-b60d-5c3da2dcd3f8"
      + pi_volume_name        = "suse-test-volume"
      + pi_volume_shareable   = false
      + pi_volume_size        = 20
      + pi_volume_type        = "tier1"
      + volume_id             = (known after apply)
      + volume_status         = (known after apply)
      + wwn                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ibm_pi_volume.suse_volume: Creating...
ibm_pi_volume.suse_volume: Still creating... [10s elapsed]
ibm_pi_volume.suse_volume: Still creating... [20s elapsed]
ibm_pi_volume.suse_volume: Creation complete after 23s [id=94ded72b-b08d-4618-b60d-5c3da2dcd3f8/95f226b0-c5bd-4eff-a94b-3adc069aa423]
ibm_pi_instance.suse_instance: Creating...
ibm_pi_instance.suse_instance: Still creating... [10s elapsed]
ibm_pi_instance.suse_instance: Still creating... [20s elapsed]
ibm_pi_instance.suse_instance: Still creating... [30s elapsed]
ibm_pi_instance.suse_instance: Still creating... [40s elapsed]
ibm_pi_instance.suse_instance: Still creating... [50s elapsed]
ibm_pi_instance.suse_instance: Still creating... [1m0s elapsed]
ibm_pi_instance.suse_instance: Still creating... [1m10s elapsed]
ibm_pi_instance.suse_instance: Still creating... [1m20s elapsed]
ibm_pi_instance.suse_instance: Still creating... [1m30s elapsed]
ibm_pi_instance.suse_instance: Still creating... [1m40s elapsed]
ibm_pi_instance.suse_instance: Still creating... [1m50s elapsed]
ibm_pi_instance.suse_instance: Still creating... [2m0s elapsed]
ibm_pi_instance.suse_instance: Still creating... [2m10s elapsed]
ibm_pi_instance.suse_instance: Still creating... [2m20s elapsed]
ibm_pi_instance.suse_instance: Still creating... [2m30s elapsed]
ibm_pi_instance.suse_instance: Still creating... [2m40s elapsed]
ibm_pi_instance.suse_instance: Still creating... [2m50s elapsed]

Error: Failed to create the lpar

  on test.tf line 35, in resource "ibm_pi_instance" "suse_instance":
  35: resource "ibm_pi_instance" "suse_instance" {
```

I received the following error when trying to delete the failed instance via the web console.

```
Error
Unexpected error value: { message: "Unexpected error value: \"internal server error - an error has occurred; please try again: Unable to get Volume 13934299-1066-4ab2-b352-1fde4fc380cc: Resource not found\"", locations: [[Object]], path: ["doServer"], extensions: { code: "INTERNAL_SERVER_ERROR" } }
June 28, 2021, 4:16:25 PM
```

I did a terraform refresh and the terraform show output is below.

```
> terraform show
# ibm_pi_instance.suse_instance: (tainted)
resource "ibm_pi_instance" "suse_instance" {
    addresses                 = []
    health_status             = "CRITICAL"
    id                        = "94ded72b-b08d-4618-b60d-5c3da2dcd3f8/16fbfb36-a233-4ab6-a66c-0a30346ff67f"
    instance_id               = "16fbfb36-a233-4ab6-a66c-0a30346ff67f"
    max_memory                = 0
    max_processors            = 0
    max_virtual_cores         = 0
    migratable                = false
    min_memory                = 0
    min_processors            = 0
    min_virtual_cores         = 0
    pi_cloud_instance_id      = "94ded72b-b08d-4618-b60d-5c3da2dcd3f8"
    pi_health_status          = "WARNING"
    pi_image_id               = "894fd208-ec75-4a2d-93a9-375ef5cb86c0"
    pi_instance_name          = "suse-test"
    pi_key_pair_name          = "suse-ibm"
    pi_memory                 = 0
    pi_network_ids            = []
    pi_pin_policy             = "none"
    pi_processors             = 0
    pi_progress               = 0
    pi_replicants             = 1
    pi_replication_policy     = "none"
    pi_replication_scheme     = "suffix"
    pi_virtual_cores_assigned = 2
    pi_volume_ids             = [
        "13934299-1066-4ab2-b352-1fde4fc380cc",
        "95f226b0-c5bd-4eff-a94b-3adc069aa423",
    ]
    pin_policy                = "none"
    status                    = "ERROR"
}

# ibm_pi_volume.suse_volume:
resource "ibm_pi_volume" "suse_volume" {
    delete_on_termination = false
    id                    = "94ded72b-b08d-4618-b60d-5c3da2dcd3f8/95f226b0-c5bd-4eff-a94b-3adc069aa423"
    pi_cloud_instance_id  = "94ded72b-b08d-4618-b60d-5c3da2dcd3f8"
    pi_volume_name        = "suse-test-volume"
    pi_volume_shareable   = false
    pi_volume_size        = 20
    pi_volume_type        = "tier1"
    volume_id             = "95f226b0-c5bd-4eff-a94b-3adc069aa423"
    volume_status         = "available"
    wwn                   = "600507681082018BC800000000001DD6"
}
```

`ibmcloud pi vols | grep 13934299-1066-4ab2-b352-1fde4fc380cc` produces no results which tells me the suse-test boot volume was not created which I believe is the cause of the ibm_pi_instance.suse_instance creation error.

Is there an undocumented "StorageType" option for the ibm_pi_instance resource that I need to be using?